Revit 2027 API
SolidSolidCutUtils.GetCuttingSolids Method
 Gets all the solids which cut the input element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ICollection<ElementId> GetCuttingSolids(
	Element element
)
Public Shared Function GetCuttingSolids (
	element As Element
) As ICollection(Of ElementId)
public:
static ICollection<ElementId^>^ GetCuttingSolids(
	Element^ element
)
static member GetCuttingSolids :
        element : Element -> ICollection<ElementId>
Parameters
element Element
 The input element.
Return Value
ICollection<ElementId>
 The ids of the solids which cut the input element.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SolidSolidCutUtils Class
Autodesk.Revit.DB Namespace